In [2]:
# Pandas: - Python library that provides data structure and methods to work with structured or tabular data, data in fast or easy way
# pandas internally uses numpy

In [3]:
# pandas 3rd party library is fast, flexible, powerfull and easy to use open source data analysis and manipulation tool, built on top of the python program

In [6]:
'''pandas supports the integration with many file formats or data sources out of the box(csv, excel, sql, json, parquet) and converts into dataframe 
vice-versa'''

'pandas supports the integration with many file formats or data sources out of the box(csv, excel, sql, json, parquet) and converts into dataframe \nvice-versa'

In [7]:
import pandas as pd

In [8]:
ser1=pd.Series([10,20,30])

In [9]:
print(ser1)

0    10
1    20
2    30
dtype: int64

In [10]:
print(type(ser1))

<class 'pandas.core.series.Series'>

In [11]:
print(ser1.dtype)

int64

In [12]:
print(ser1.index)

RangeIndex(start=0, stop=3, step=1)

In [13]:
i1=ser1.index

In [14]:
print(type(i1))

<class 'pandas.core.indexes.range.RangeIndex'>

In [16]:
v1=ser1.values

In [17]:
print(v1)

[10 20 30]

In [18]:
print(type(v1))

<class 'numpy.ndarray'>

In [19]:
# hence pandas use numpy internally

In [20]:
# we can give indexing by mentioning under index

In [21]:
ser2=pd.Series([10,20,30,40],index=[1,2,3,4])

In [22]:
print(ser2)

1    10
2    20
3    30
4    40
dtype: int64

In [23]:
ser3=pd.Series(range(10,60,10),index=range(1,6,1))

In [24]:
print(ser3)

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [25]:
v2=ser2.values

In [29]:
print(v2)

[10 20 30 40]

In [27]:
v3=ser3.values

In [28]:
print(v3)

[10 20 30 40 50]

In [31]:
# here we started index by 1 so 
print(ser3[1])

10

In [32]:
print(ser3[3])

30

In [36]:
ser4=pd.Series(range(10,40,10),index=['a','b','c'])

In [37]:
ser4

a    10
b    20
c    30
dtype: int64

In [38]:
# to fetch data using inner index we have an option called as loc and iloc

In [42]:
# iloc-inner index
# loc-outer index

print(ser3)

1    10
2    20
3    30
4    40
5    50
dtype: int64

In [40]:
ser3.iloc[0]

10

In [41]:
ser3.loc[0]

KeyError: 0

In [43]:
# we need to give exactly same number of index points to store

In [44]:
ser5=pd.Series(range(10,60,10),index=range(1,3,1))

ValueError: Length of values (5) does not match length of index (2)

In [45]:
# length of the series should be equal to length of the indexes

In [47]:
ser6=pd.Series([10,20,30], index=['Naveen','Veeresh','Shetter'])

In [48]:
print(ser6)

Naveen     10
Veeresh    20
Shetter    30
dtype: int64

In [49]:
ser7=pd.Series([10,20,30], index=['Naveen','Naveen','Naveen'])

In [50]:
print(ser7)

Naveen    10
Naveen    20
Naveen    30
dtype: int64

In [51]:
# Series are mutable

In [52]:
ser6.loc['Naveen']=89

In [53]:
print(ser6)

Naveen     89
Veeresh    20
Shetter    30
dtype: int64

In [54]:
ser7.loc['Naveen'].iloc[-1]=44

C:\Users\Skyline Solutions\AppData\Local\Temp\ipykernel_3040\3176042359.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  ser7.loc['Naveen'].iloc[-1]=44

In [55]:
print(ser7)

Naveen    10
Naveen    20
Naveen    44
dtype: int64

In [59]:
# to add or we call this operations as broadcasting(means parallel operation)

In [60]:
print(ser6+1)

Naveen     90
Veeresh    21
Shetter    31
dtype: int64

In [61]:
print(ser6)

Naveen     89
Veeresh    20
Shetter    30
dtype: int64

In [62]:
# get whose marks are greater than 100

In [63]:
ser6>100

Naveen     False
Veeresh    False
Shetter    False
dtype: bool

In [64]:
ser6>67

Naveen      True
Veeresh    False
Shetter    False
dtype: bool

In [65]:
ser6[ser6>80]

Naveen    89
dtype: int64

In [67]:
import numpy as np

ser7=pd.Series(np.random.randint(1,10,5))

In [68]:
print(ser7)

0    8
1    5
2    9
3    8
4    9
dtype: int32

In [69]:
# to print even numbers in series

ser7[ser7%2==0]

0    8
3    8
dtype: int32

In [70]:
print(ser7.loc[1])

5

In [74]:
print(ser7.loc[1::])

1    5
2    9
3    8
4    9
dtype: int32

In [76]:
# creating series using addict

matches_won={'IN':9,'PAK':4,'SA':7,'ENG':3,'AFG':4}

print(matches_won)

{'IN': 9, 'PAK': 4, 'SA': 7, 'ENG': 3, 'AFG': 4}

In [77]:
s1=pd.Series(matches_won)

In [78]:
print(s1)

IN     9
PAK    4
SA     7
ENG    3
AFG    4
dtype: int64

In [79]:
# NAN is a value used to represent a missing value in both pd and np

In [80]:
ser9=pd.Series(matches_won)

In [81]:
print(ser9)

IN     9
PAK    4
SA     7
ENG    3
AFG    4
dtype: int64

In [82]:
print(ser9.index)

Index(['IN', 'PAK', 'SA', 'ENG', 'AFG'], dtype='object')

In [83]:
print(ser9.value_counts)

<bound method IndexOpsMixin.value_counts of IN     9
PAK    4
SA     7
ENG    3
AFG    4
dtype: int64>

In [84]:
print(ser9.values)

[9 4 7 3 4]

In [85]:
ser9=pd.Series(matches_won,index=['PAK','SA','BR'])

In [86]:
print(ser9)

PAK    4.0
SA     7.0
BR     NaN
dtype: float64

In [87]:
print(type(ser9))

<class 'pandas.core.series.Series'>

In [88]:
print(ser9.dtype)

float64

In [89]:
ser10=pd.Series([10,20,30,'H'])

In [90]:
ser10

0    10
1    20
2    30
3     H
dtype: object

In [91]:
print(type(ser10))

<class 'pandas.core.series.Series'>

In [92]:
ser11=pd.Series({'nov':90,'ver':96})

In [93]:
print(ser11)

nov    90
ver    96
dtype: int64

In [94]:
ser12=pd.Series({'nov':89,'ver':96})

In [95]:
print(ser12)

nov    89
ver    96
dtype: int64

In [96]:
# we can add or do any arithmatic operation like

print(ser11+ser12)

nov    179
ver    192
dtype: int64

In [97]:
total=ser11+ser12

In [98]:
print(total)

nov    179
ver    192
dtype: int64

In [99]:
print(type(total))

<class 'pandas.core.series.Series'>

In [101]:
print(total.isnull())

nov    False
ver    False
dtype: bool

In [103]:
print(total[total.isnull()])

Series([], dtype: int64)

In [104]:
print(total[total.notnull()])

nov    179
ver    192
dtype: int64

In [105]:
ser11=pd.Series({'Naveen':90,'Veeresh':95,'Shetter':98})

In [106]:
print(ser11)

Naveen     90
Veeresh    95
Shetter    98
dtype: int64

In [107]:
# ascending

In [108]:
print(ser11.sort_values(ascending=True))

Naveen     90
Veeresh    95
Shetter    98
dtype: int64

In [109]:
print(ser11.sort_values(ascending=False))

Shetter    98
Veeresh    95
Naveen     90
dtype: int64

In [110]:
# dataframes

In [111]:
data1={'name':['Naveen','Veeresh','Shetter'],'marks':[10,20,30],'age':[20,19,90]}

In [112]:
print(data1)

{'name': ['Naveen', 'Veeresh', 'Shetter'], 'marks': [10, 20, 30], 'age': [20, 19, 90]}

In [113]:
df1=pd.DataFrame(data1)

In [114]:
print(df1)

      name  marks  age
0   Naveen     10   20
1  Veeresh     20   19
2  Shetter     30   90

In [115]:
print(type(df1))

<class 'pandas.core.frame.DataFrame'>

In [116]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [118]:
df1.values

array([['Naveen', 10, 20],
       ['Veeresh', 20, 19],
       ['Shetter', 30, 90]], dtype=object)

In [120]:
df1.columns

Index(['name', 'marks', 'age'], dtype='object')

In [121]:
# to make a dataframe all have same length

In [122]:
df1.index

RangeIndex(start=0, stop=3, step=1)

In [123]:
df1.columns

Index(['name', 'marks', 'age'], dtype='object')

In [124]:
df1.values

array([['Naveen', 10, 20],
       ['Veeresh', 20, 19],
       ['Shetter', 30, 90]], dtype=object)

In [128]:
data=data1

In [129]:
df2=pd.DataFrame(data,columns=['ids','percent','grades'])

In [130]:
df2

Empty DataFrame
Columns: [ids, percent, grades]
Index: []

In [131]:
df2=pd.DataFrame(data,columns=['ids','percents','grades'])

In [132]:
print(df2)

Empty DataFrame
Columns: [ids, percents, grades]
Index: []

In [134]:
df3=pd.DataFrame(data,index=data['name'],columns=['ids','percents'])

In [135]:
df3

         ids percents
Naveen   NaN      NaN
Veeresh  NaN      NaN
Shetter  NaN      NaN

In [136]:
print(data)

{'name': ['Naveen', 'Veeresh', 'Shetter'], 'marks': [10, 20, 30], 'age': [20, 19, 90]}

In [137]:
print(type(data))

<class 'dict'>

In [138]:
print(data1)

{'name': ['Naveen', 'Veeresh', 'Shetter'], 'marks': [10, 20, 30], 'age': [20, 19, 90]}

In [139]:
print(type(data1))

<class 'dict'>

In [140]:
df1

      name  marks  age
0   Naveen     10   20
1  Veeresh     20   19
2  Shetter     30   90

In [141]:
# drop or deleting a column

In [174]:
data={'name':['Naveen','Veeresh','Shetter'],
     'ids':[101,102,103],
     'percents':[89,90,97]}

In [175]:
data

{'name': ['Naveen', 'Veeresh', 'Shetter'],
 'ids': [101, 102, 103],
 'percents': [89, 90, 97]}

In [176]:
df2=pd.DataFrame(data)

In [177]:
print(df2)

      name  ids  percents
0   Naveen  101        89
1  Veeresh  102        90
2  Shetter  103        97

In [178]:
# # drop or deleting a column

In [179]:
df2.drop(['percents'],axis=1)

      name  ids
0   Naveen  101
1  Veeresh  102
2  Shetter  103

In [180]:
print(df2)

      name  ids  percents
0   Naveen  101        89
1  Veeresh  102        90
2  Shetter  103        97

In [181]:
# here it is not deleted completely so you need to delete by putting inplace=True

In [182]:
df3=pd.DataFrame(data)

In [183]:
df3

      name  ids  percents
0   Naveen  101        89
1  Veeresh  102        90
2  Shetter  103        97

In [184]:
df3.drop(['percents'],axis=1,inplace=True)

In [185]:
print(df3)

      name  ids
0   Naveen  101
1  Veeresh  102
2  Shetter  103

In [186]:
# now to delete a row

In [187]:
df3.drop([0],axis=0,inplace=True)

In [188]:
print(df3)

      name  ids
1  Veeresh  102
2  Shetter  103

In [189]:
df3['percents']=[10,20]

In [190]:
df3

      name  ids  percents
1  Veeresh  102        10
2  Shetter  103        20

In [193]:
df3['pe']=[10,20,30]

# here while creating, we can add directly but index length should be same

ValueError: Length of values (3) does not match length of index (2)

In [194]:
df3

      name  ids  percents
1  Veeresh  102        10
2  Shetter  103        20

In [195]:
df2

      name  ids  percents
0   Naveen  101        89
1  Veeresh  102        90
2  Shetter  103        97

In [196]:
df2['percents']>90

0    False
1    False
2     True
Name: percents, dtype: bool

In [197]:
df2[df2['percents']>90]

      name  ids  percents
2  Shetter  103        97

In [198]:
df2[df2['percents']<90]

     name  ids  percents
0  Naveen  101        89

In [200]:
df2[df2['percents']==90]

      name  ids  percents
1  Veeresh  102        90

In [201]:
arr1=np.where(df2['percents']>=90,'yes','no')

In [202]:
arr1

array(['no', 'yes', 'yes'], dtype='<U3')

In [203]:
print(arr1)

['no' 'yes' 'yes']

In [209]:
df2['good']=arr1

In [210]:
df2

      name  ids  percents good
0   Naveen  101        89   no
1  Veeresh  102        90  yes
2  Shetter  103        97  yes

In [216]:
df2.loc[3]=['Ling','104','100','yes']

In [217]:
df2

      name  ids percents good
0   Naveen  101       89   no
1  Veeresh  102       90  yes
2  Shetter  103       97  yes
3     Ling  104      100  yes

In [218]:
# the above thing can be done by

In [220]:
def cal_grades(percent):
    if percent>=95:
        return 'A'
    else:
        return 'B'

df2['grades']=df2['percents'].apply(cal_grades)

TypeError: '>=' not supported between instances of 'str' and 'int'

In [221]:
df2.drop([3],axis=0,inplace=True)

In [222]:
df2

      name  ids percents good
0   Naveen  101       89   no
1  Veeresh  102       90  yes
2  Shetter  103       97  yes

In [223]:
df2.loc[3]=['Ling','104',100,'yes']

In [224]:
df2

      name  ids percents good
0   Naveen  101       89   no
1  Veeresh  102       90  yes
2  Shetter  103       97  yes
3     Ling  104      100  yes

In [227]:
print(type(df2['percents']))

<class 'pandas.core.series.Series'>

In [228]:
def cal_grades(percent):
    if percent>=95:
        return 'A'
    else:
        return 'B'

df2['grades']=df2['percents'].apply(cal_grades)

In [229]:
df2

      name  ids percents good grades
0   Naveen  101       89   no      B
1  Veeresh  102       90  yes      B
2  Shetter  103       97  yes      A
3     Ling  104      100  yes      A

In [230]:
df2.describe

<bound method NDFrame.describe of       name  ids percents good grades
0   Naveen  101       89   no      B
1  Veeresh  102       90  yes      B
2  Shetter  103       97  yes      A
3     Ling  104      100  yes      A>

In [231]:
df2.describe()

          name  ids  percents good grades
count        4    4         4    4      4
unique       4    4         4    2      2
top     Naveen  101        89  yes      B
freq         1    1         1    3      2

In [232]:
# 15nov

In [233]:
data={'Company':['A','B','C','D'],
     'Year':[2019,2020,2021,2022],
     'Sales':[100,89,90,91],
     'Profits':[11,9,4,5]}

In [234]:
df1=pd.DataFrame(data)

In [235]:
df1

  Company  Year  Sales  Profits
0       A  2019    100       11
1       B  2020     89        9
2       C  2021     90        4
3       D  2022     91        5

In [236]:
df1['Year']

0    2019
1    2020
2    2021
3    2022
Name: Year, dtype: int64

In [238]:
df1.describe()

              Year       Sales    Profits
count     4.000000    4.000000   4.000000
mean   2020.500000   92.500000   7.250000
std       1.290994    5.066228   3.304038
min    2019.000000   89.000000   4.000000
25%    2019.750000   89.750000   4.750000
50%    2020.500000   90.500000   7.000000
75%    2021.250000   93.250000   9.500000
max    2022.000000  100.000000  11.000000

In [239]:
df1.isnull()

   Company   Year  Sales  Profits
0    False  False  False    False
1    False  False  False    False
2    False  False  False    False
3    False  False  False    False

In [240]:
df1.isnull

<bound method DataFrame.isnull of   Company  Year  Sales  Profits
0       A  2019    100       11
1       B  2020     89        9
2       C  2021     90        4
3       D  2022     91        5>

In [245]:
print(type(df1['Year'][0]))

<class 'numpy.int64'>

In [246]:
df1['Year']

0    2019
1    2020
2    2021
3    2022
Name: Year, dtype: int64

In [247]:
# type convertion

In [251]:
df1.describe(include=None)

              Year       Sales    Profits
count     4.000000    4.000000   4.000000
mean   2020.500000   92.500000   7.250000
std       1.290994    5.066228   3.304038
min    2019.000000   89.000000   4.000000
25%    2019.750000   89.750000   4.750000
50%    2020.500000   90.500000   7.000000
75%    2021.250000   93.250000   9.500000
max    2022.000000  100.000000  11.000000

In [254]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  4 non-null      object
 1   Year     4 non-null      int64
 2   Sales    4 non-null      int64
 3   Profits  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [258]:
df1['Year'].astype(object)

0    2019
1    2020
2    2021
3    2022
Name: Year, dtype: object

In [259]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  4 non-null      object
 1   Year     4 non-null      int64
 2   Sales    4 non-null      int64
 3   Profits  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [261]:
df1['Company']

0    A
1    B
2    C
3    D
Name: Company, dtype: object

In [263]:
df1['Year'].value_counts()

Year
2019    1
2020    1
2021    1
2022    1
Name: count, dtype: int64

In [264]:
df1['Profits']

0    11
1     9
2     4
3     5
Name: Profits, dtype: int64

In [265]:
df1['Sales']

0    100
1     89
2     90
3     91
Name: Sales, dtype: int64

In [266]:
# fetch the rows which has only company B

In [267]:
df1['Company']=='B'

0    False
1     True
2    False
3    False
Name: Company, dtype: bool

In [268]:
df1[df1['Company']=='B']

  Company  Year  Sales  Profits
1       B  2020     89        9

In [270]:
df1[df1['Sales']>=90]

  Company  Year  Sales  Profits
0       A  2019    100       11
2       C  2021     90        4
3       D  2022     91        5

In [271]:
df1[df1['Sales']>=90]['Company']

0    A
2    C
3    D
Name: Company, dtype: object

In [272]:
df1[df1['Sales']>=90]['Profits']

0    11
2     4
3     5
Name: Profits, dtype: int64

In [276]:
df1[df1['Company']=='B']

  Company  Year  Sales  Profits
1       B  2020     89        9

In [277]:
df1['Company']

0    A
1    B
2    C
3    D
Name: Company, dtype: object

In [278]:
df1[df1['Company']=='B']

  Company  Year  Sales  Profits
1       B  2020     89        9

In [279]:
df1[df1['Company']=='B']['Sales']

1    89
Name: Sales, dtype: int64

In [280]:
df1[df1['Sales']>70].value_counts()

Company  Year  Sales  Profits
A        2019  100    11         1
B        2020  89     9          1
C        2021  90     4          1
D        2022  91     5          1
Name: count, dtype: int64

In [282]:
df1[df1['Profits']<70]['Profits']

0    11
1     9
2     4
3     5
Name: Profits, dtype: int64

In [286]:
df1[df1['Profits']<70][['Year','Company']]

   Year Company
0  2019       A
1  2020       B
2  2021       C
3  2022       D

In [298]:
df1[(df1['Company']=='A') & (df1['Profits']<40)]

  Company  Year  Sales  Profits
0       A  2019    100       11

In [301]:
df1[(df1['Sales']>100) | (df1['Profits']>10)]

  Company  Year  Sales  Profits
0       A  2019    100       11

In [292]:
df1[df1['Profits']<40]

  Company  Year  Sales  Profits
0       A  2019    100       11
1       B  2020     89        9
2       C  2021     90        4
3       D  2022     91        5

In [302]:
# query

In [305]:
df1.query("Company=='A'")

  Company  Year  Sales  Profits
0       A  2019    100       11

In [306]:
df1.query("Company=='A' and Profits>30")

Empty DataFrame
Columns: [Company, Year, Sales, Profits]
Index: []

In [307]:
df1.query("Company=='A' or Profits>30")

  Company  Year  Sales  Profits
0       A  2019    100       11

In [308]:
# find mean of profit of company A

In [310]:
df1[df1['Company']=='A']['Profits']

0    11
Name: Profits, dtype: int64

In [311]:
df1[df1['Company']=='A']['Profits'].mean()

11.0

In [312]:
df1['Company'].mode()

0    A
1    B
2    C
3    D
Name: Company, dtype: object

In [313]:
df1['Company'].describe()

count     4
unique    4
top       A
freq      1
Name: Company, dtype: object

In [314]:
df1.describe()

              Year       Sales    Profits
count     4.000000    4.000000   4.000000
mean   2020.500000   92.500000   7.250000
std       1.290994    5.066228   3.304038
min    2019.000000   89.000000   4.000000
25%    2019.750000   89.750000   4.750000
50%    2020.500000   90.500000   7.000000
75%    2021.250000   93.250000   9.500000
max    2022.000000  100.000000  11.000000

In [315]:
df1['Year'].mode()

0    2019
1    2020
2    2021
3    2022
Name: Year, dtype: int64

In [316]:
df1['Year'].max()

2022

In [317]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  4 non-null      object
 1   Year     4 non-null      int64
 2   Sales    4 non-null      int64
 3   Profits  4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 260.0+ bytes

In [319]:
df1.describe()

              Year       Sales    Profits
count     4.000000    4.000000   4.000000
mean   2020.500000   92.500000   7.250000
std       1.290994    5.066228   3.304038
min    2019.000000   89.000000   4.000000
25%    2019.750000   89.750000   4.750000
50%    2020.500000   90.500000   7.000000
75%    2021.250000   93.250000   9.500000
max    2022.000000  100.000000  11.000000

In [320]:
df1['Sales'].quantile()

90.5

In [321]:
df1['Sales'].quantile(.25)

89.75

In [322]:
df1['Sales'].quantile(1)

100.0

In [323]:
df1['Sales'].quantile(0.5)

90.5

In [324]:
# pivot: - Index, column, and row

In [325]:
pivot_df=df1.pivot(index='Company',columns='Year',values='Sales')

In [326]:
print(pivot_df)

Year      2019  2020  2021  2022
Company
A        100.0   NaN   NaN   NaN
B          NaN  89.0   NaN   NaN
C          NaN   NaN  90.0   NaN
D          NaN   NaN   NaN  91.0

In [328]:
pivot_df=df1.pivot(index='Company',columns='Year',values=['Sales','Profits'])

In [329]:
print(pivot_df)

         Sales                   Profits
Year      2019  2020  2021  2022    2019 2020 2021 2022
Company
A        100.0   NaN   NaN   NaN    11.0  NaN  NaN  NaN
B          NaN  89.0   NaN   NaN     NaN  9.0  NaN  NaN
C          NaN   NaN  90.0   NaN     NaN  NaN  4.0  NaN
D          NaN   NaN   NaN  91.0     NaN  NaN  NaN  5.0